Model: "custom_yolo"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 416, 416, 3) 0
__________________________________________________________________________________________________
tf_op_layer_truediv (TensorFlow [(None, 416, 416, 3) 0           input_1[0][0]
__________________________________________________________________________________________________
tf_op_layer_sub (TensorFlowOpLa [(None, 416, 416, 3) 0           tf_op_layer_truediv[0][0]
__________________________________________________________________________________________________
down_stack (Functional)         [(None, 52, 52, 192) 873984      tf_op_layer_sub[0][0]
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 26, 26, 384)  3318144     down_stack[0][2]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 26, 26, 384)  1536        conv2d_transpose[0][0]
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 26, 26, 384)  0           batch_normalization[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 26, 26, 768)  0           re_lu[0][0]
                                                                 down_stack[0][1]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 52, 52, 192)  1327296     concatenate[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 52, 52, 192)  768         conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 52, 52, 192)  0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 52, 52, 384)  0           re_lu_1[0][0]
                                                                 down_stack[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 52, 52, 384)  0           concatenate_1[0][0]
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 26, 26, 192)  663744      dropout[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 26, 26, 192)  768         conv2d[0][0]
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 26, 26, 192)  0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 26, 26, 64)   110656      re_lu_2[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 26, 26, 64)   256         conv2d_1[0][0]
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 26, 26, 64)   0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 26, 26, 64)   36928       re_lu_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 26, 26, 64)   256         conv2d_2[0][0]
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 26, 26, 64)   0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 13, 13, 24)   13848       re_lu_4[0][0]
__________________________________________________________________________________________________
final_output (Reshape)          (None, 13, 13, 3, 8) 0           conv2d_3[0][0]
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 1, 1, 1, 111 0
__________________________________________________________________________________________________
hack_layer (Lambda)             (None, 13, 13, 3, 8) 0           final_output[0][0]
                                                                 input_2[0][0]
==================================================================================================
Total params: 6,348,184
Trainable params: 5,472,408
Non-trainable params: 875,776
__________________________________________________________________________________________________

Epoch 1: Learning rate is 0.0004.
Epoch 1/3
2021-12-19 21:44:27.248206: I tensorflow/stream_executor/platform/default/dso_loader.cc:48] Successfully opened dynamic library cudnn64_7.dll
2021-12-19 21:44:28.301519: W tensorflow/stream_executor/gpu/redzone_allocator.cc:314] Internal: Invoking GPU asm compilation is supported on Cuda non-Windows platforms only
Relying on driver to perform ptx compilation.
Modify $PATH to customize ptxas location.
This message will be only logged once.
2021-12-19 21:44:28.370087: I tensorflow/stream_executor/platform/default/dso_loader.cc:48] Successfully opened dynamic library cublas64_10.dll
1934/1934 [==============================] - ETA: 0s - batch: 966.5000 - size: 15.9974 - loss: 33.1277WARNING:tensorflow:From C:\Users\Dragos\AppData\Local\Programs\Python\Python37-64\lib\site-packages\tensorflow\python\keras\engine\training_v1.py:2048: Model.state_updates (from tensorflow.python.keras.engine.training) is deprecated and will be removed in a future version.
Instructions for updating:
This property should not be used in TensorFlow 2.0, as updates are applied automatically.

Epoch 00001: val_loss improved from inf to 31.38401, saving model to weights\model.h5
1934/1934 [==============================] - 901s 466ms/step - batch: 966.5000 - size: 15.9974 - loss: 33.1277 - val_loss: 31.3840

Epoch 2: Learning rate is 0.0003990371860981058.
Epoch 2/3
1934/1934 [==============================] - ETA: 0s - batch: 966.5000 - size: 15.9974 - loss: 29.3214
Epoch 00002: val_loss improved from 31.38401 to 31.27766, saving model to weights\model.h5
1934/1934 [==============================] - 895s 463ms/step - batch: 966.5000 - size: 15.9974 - loss: 29.3214 - val_loss: 31.2777

Epoch 3: Learning rate is 0.00039615801681662597.
Epoch 3/3
1934/1934 [==============================] - ETA: 0s - batch: 966.5000 - size: 15.9974 - loss: 29.2054
Epoch 00003: val_loss improved from 31.27766 to 31.03371, saving model to weights\model.h5
1934/1934 [==============================] - 896s 463ms/step - batch: 966.5000 - size: 15.9974 - loss: 29.2054 - val_loss: 31.0337
